/*
 * Copyright (c) 2004 ITE Technology Corp. All Rights Reserved.
 */
/** @file
 * This file defines all associated data structure, constant,and variable for
 * engine programming.
 *
 * @author Erica Chang
 * @version 0.1
 */

#ifndef __ENGINE_H
#define __ENGINE_H

#include "m2d/m2d_graphics.h"
#include "m2d/iteM2dDefs.h"

#ifdef __cplusplus
extern "C" {
#endif

//=============================================================================
//                              Constant Definition
//=============================================================================
//Define HW limitation
#define M2D_PITCH_MAX            8188
#define M2D_HEIGHT_MAX           2047
#define M2D_LINE_MAJOR_AXIAL_MAX 4095
#define M2D_LINE_TERM_PARAM_MAX  4096 * 4096 - 2
#define M2D_LINE_TERM_PARAM_MIN  -(4096 * 4096 - 2)

#define M2D_LINE_STYLE_PERIOD    31

#define LINECLIPMAX              511
#define LINECLIPMIN              -512
#define MAXRECTWIDTH             511
#define MAXRECTHEIGHT            511

//Define rop type, for internal use
#define     PSD                  0
#define     SD                   1
#define     PD                   2
#define     D                    3

//Define brush type, for internal use
#define     M2D_SOLID_BRUSH      1
#define     M2D_HATCH_BRUSH      2
#define     M2D_PAT_BRUSH        3

//Define the max value of bitbltId2
#define     MAX_BITBLTID2_VALUE  0x7FFF

/* ======================================== */
/*              ITE Register                */

    HW_BLEND_MULTIPLY       = 0x5,
    HW_BLEND_SCREEN         = 0x6,
    HW_BLEND_DARKEN         = 0x7,
    HW_BLEND_LIGHTEN        = 0x8,
    HW_BLEND_ADDITIVE       = 0x9,
    HW_BLEND_CONSTANT_Alpha = 0x0A,
    HW_UNION_MASK           = 0x10,
    HW_INTERSECT_MASK       = 0x11,
    HW_SUBTRACT_MASK        = 0x12
} HWBlendMode;

typedef enum {
    HW_UNION_RENDERMASK     = 0x0,
    HW_INTERSECT_RENDERMASK = 0x1,
    HW_SUBTRACT_RENDERMASK  = 0x2
} HWMaskMode;

typedef enum {
    HW_DRAW_IMAGE_NORMAL   = 0x0,
    HW_DRAW_IMAGE_MULTIPLY = 0x1,
    HW_DRAW_IMAGE_STENCIL  = 0x2
} HWImageMode;

typedef enum {
    HW_FILL_PATH   = 0,
    HW_STROKE_PATH = 1
} HWPaintMode;

typedef enum {
    HW_CAP_BUTT   = 0x0,
    HW_CAP_ROUND  = 0x1,
    HW_CAP_SQUARE = 0x2
} HWCapStyle;

typedef enum {
    HW_JOIN_MITER = 0x0,
    HW_JOIN_ROUND = 0x1,
    HW_JOIN_BEVEL = 0x2
} HWJoinStyle;

typedef enum {
    HW_COLOR_RAMP_SPREAD_PAD     = 0,
    HW_COLOR_RAMP_SPREAD_REPEAT  = 1,
    HW_COLOR_RAMP_SPREAD_REFLECT = 2
} HWColorRampSpreadMode;

typedef enum {
    HW_PAINT_TYPE_COLOR           = 0,
    HW_PAINT_TYPE_LINEAR_GRADIENT = 1,
    HW_PAINT_TYPE_RADIAL_GRADIENT = 2,
    HW_PAINT_TYPE_PATTERN         = 3
} HWPaintType;

typedef enum {
    HW_TILE_FILL    = 0,
    HW_TILE_PAD     = 1,
    HW_TILE_REPEAT  = 2,
    HW_TILE_REFLECT = 3
} HWTilingMode;

typedef enum {
    /* RGB{A,X} channel ordering */
    HW_sRGBX_8888     = 0,
    HW_sRGBA_8888     = 1,
    HW_sRGBA_8888_PRE = 2,
    HW_sRGB_565       = 3,
    HW_sRGBA_5551     = 4,
    HW_sRGBA_4444     = 5,
    HW_sL_8           = 6,
    HW_lRGBX_8888     = 7,
    HW_lRGBA_8888     = 8,
    HW_lRGBA_8888_PRE = 9,
    HW_lL_8           = 10,
    HW_A_8            = 11,
    HW_BW_1           = 12,
    HW_A_1            = 13,
    HW_A_4            = 14,
    HW_RGBA_16        = 15,

    /* {A,X}RGB channel ordering */
    HW_sXRGB_8888     = 0 | (1 << 6),
    HW_sARGB_8888     = 1 | (1 << 6),
    HW_sARGB_8888_PRE = 2 | (1 << 6),
    HW_sARGB_1555     = 4 | (1 << 6),
    HW_sARGB_4444     = 5 | (1 << 6),
    HW_lXRGB_8888     = 7 | (1 << 6),
    HW_lARGB_8888     = 8 | (1 << 6),
    HW_lARGB_8888_PRE = 9 | (1 << 6),

    /* BGR{A,X} channel ordering */
    HW_sBGRX_8888     = 0 | (1 << 7),
    HW_sBGRA_8888     = 1 | (1 << 7),
    HW_sBGRA_8888_PRE = 2 | (1 << 7),
    HW_sBGR_565       = 3 | (1 << 7),
    HW_sBGRA_5551     = 4 | (1 << 7),
    HW_sBGRA_4444     = 5 | (1 << 7),
    HW_lBGRX_8888     = 7 | (1 << 7),
    HW_lBGRA_8888     = 8 | (1 << 7),
    HW_lBGRA_8888_PRE = 9 | (1 << 7),

    /* {A,X}BGR channel ordering */
    HW_sXBGR_8888     = 0 | (1 << 6) | (1 << 7),
    HW_sABGR_8888     = 1 | (1 << 6) | (1 << 7),
    HW_sABGR_8888_PRE = 2 | (1 << 6) | (1 << 7),
    HW_sABGR_1555     = 4 | (1 << 6) | (1 << 7),
    HW_sABGR_4444     = 5 | (1 << 6) | (1 << 7),
    HW_lXBGR_8888     = 7 | (1 << 6) | (1 << 7),
    HW_lABGR_8888     = 8 | (1 << 6) | (1 << 7),
    HW_lABGR_8888_PRE = 9 | (1 << 6) | (1 << 7),
} HWImageFormat;

typedef struct
{
    ITEM2Ds12p3 x, y;       //s12.3
} HWVector2;

typedef struct
{
    ITEM2Ds15p16 x, y;  //s15.16
} HWTXVector2;

typedef struct
{
    ITEM2Ds15p16 x;         //s15.16
    ITEM2Ds12p3  y;         //s12.3
} HWPXVector2;

typedef struct
{
    ITEM2Ds12p3 x, y, z;    //s12.3
} HWVector3;

typedef struct
{
    ITEM2Ds15p16 x, y, z;   //s15.16
} HWTXVector3;

typedef struct
{
    ITEM2Ds15p16 m[3][3]; //s15.16
} HWMatrix3x3;

// (v, mat, vout) = (s12.3, s15.16, s12.16)
#define HW0TRANSFORM3TO(v, mat, vout)           { \
        vout.x = (ITEM2Dint32)(((ITEM2Dint)v.x * mat.m[0][0] + (ITEM2Dint)v.y * mat.m[0][1] + (ITEM2Dint)v.z * mat.m[0][2] + (1 << 2) ) >> 3); \
        vout.y = (ITEM2Dint32)(((ITEM2Dint)v.x * mat.m[1][0] + (ITEM2Dint)v.y * mat.m[1][1] + (ITEM2Dint)v.z * mat.m[1][2] + (1 << 2) ) >> 3); \
        vout.z = (ITEM2Dint32)(((ITEM2Dint)v.x * mat.m[2][0] + (ITEM2Dint)v.y * mat.m[2][1] + (ITEM2Dint)v.z * mat.m[2][2] + (1 << 2) ) >> 3); }

// (v, mat, vout) = (s12.3, s15.16, s12.3)
#define HW1TRANSFORM3TO(v, mat, vout)           { \
        vout.x = (ITEM2Dint16)(((ITEM2Dint)v.x * mat.m[0][0] + (ITEM2Dint)v.y * mat.m[0][1] + (ITEM2Dint)v.z * mat.m[0][2] + (1 << 15) ) >> 16); \
        vout.y = (ITEM2Dint16)(((ITEM2Dint)v.x * mat.m[1][0] + (ITEM2Dint)v.y * mat.m[1][1] + (ITEM2Dint)v.z * mat.m[1][2] + (1 << 15) ) >> 16); \
        vout.z = (ITEM2Dint16)(((ITEM2Dint)v.x * mat.m[2][0] + (ITEM2Dint)v.y * mat.m[2][1] + (ITEM2Dint)v.z * mat.m[2][2] + (1 << 15) ) >> 16); }

// (v, mat, vout) = (s12.3, s15.16, s15.16)
#define HW0TRANSFORM2TO(v, mat, vout)           { \
        vout.x = (ITEM2Dint32)(((ITEM2Dint)v.x * mat.m[0][0] + (ITEM2Dint)v.y * mat.m[0][1] + 8 * mat.m[0][2] + (1 << 2) ) >> 3); \
        vout.y = (ITEM2Dint32)(((ITEM2Dint)v.x * mat.m[1][0] + (ITEM2Dint)v.y * mat.m[1][1] + 8 * mat.m[1][2] + (1 << 2) ) >> 3); }

// (v, mat, vout) = (s15.16, s15.16, s12.3)
#define HW1TRANSFORM2TO(v, mat, vout)           { \
        vout.x = (ITEM2Dint16)(((ITEM2Dint64)v.x * mat.m[0][0] + (ITEM2Dint64)v.y * mat.m[0][1] + (ITEM2Dint64)0x10000 * mat.m[0][2] + (1 << 28) ) >> 29); \
        vout.y = (ITEM2Dint16)(((ITEM2Dint64)v.x * mat.m[1][0] + (ITEM2Dint64)v.y * mat.m[1][1] + (ITEM2Dint64)0x10000 * mat.m[1][2] + (1 << 28) ) >> 29); }

// (v, mat, vout) = (s12.11, s15.16, s12.3)
#define HWAFFINETRANSFORM2TO(v, mat, vout)      { \
        vout.x = (ITEM2Dint32)(((ITEM2Dint64)v.x * mat.m[0][0] + (ITEM2Dint64)v.y * mat.m[0][1] + (ITEM2Dint64)(1 << POINTPREC) * mat.m[0][2] + (1 << ((POINTPREC + 16 - 3) - 1)) ) >> (POINTPREC + 16 - 3)); \
        vout.y = (ITEM2Dint32)(((ITEM2Dint64)v.x * mat.m[1][0] + (ITEM2Dint64)v.y * mat.m[1][1] + (ITEM2Dint64)(1 << POINTPREC) * mat.m[1][2] + (1 << ((POINTPREC + 16 - 3) - 1)) ) >> (POINTPREC + 16 - 3)); }

// (v, mat, vout) = (s12.11, s15.16, s12.3 = s12.19 / s12.16)
#define HWPERSPECTIVETRANSFORM3TO(v, mat, vout) { \
        vout.x = (ITEM2Dint32)( (((ITEM2Dint64)v.x * mat.m[0][0] + (ITEM2Dint64)v.y * mat.m[0][1] + (ITEM2Dint64)(1 << POINTPREC) * mat.m[0][2] + (1 << (POINTPREC + 16 - 19 - 1)) ) >> (POINTPREC + 16 - 19)) / \
                                (((ITEM2Dint64)v.x * mat.m[2][0] + (ITEM2Dint64)v.y * mat.m[2][1] + (ITEM2Dint64)(1 << POINTPREC) * mat.m[2][2] + (1 << (POINTPREC + 16 - 19 - 1)) ) >> (POINTPREC + 16 - 16)) ); \
        vout.y = (ITEM2Dint32)( (((ITEM2Dint64)v.x * mat.m[1][0] + (ITEM2Dint64)v.y * mat.m[1][1] + (ITEM2Dint64)(1 << POINTPREC) * mat.m[1][2] + (1 << (POINTPREC + 16 - 19 - 1)) ) >> (POINTPREC + 16 - 19)) / \
                                (((ITEM2Dint64)v.x * mat.m[2][0] + (ITEM2Dint64)v.y * mat.m[2][1] + (ITEM2Dint64)(1 << POINTPREC) * mat.m[2][2] + (1 << (POINTPREC + 16 - 19 - 1)) ) >> (POINTPREC + 16 - 16)) ); }

// (v, mat, vout) = (s15.16, s15.16, s12.3)
#define HW1TRANSFORM2DIR(v, mat, vout)          { \
        vout.x = (ITEM2Dint16)(((ITEM2Dint64)v.x * mat.m[0][0] + (ITEM2Dint64)v.y * mat.m[0][1] + (1 << 28) ) >> 29); \
        vout.y = (ITEM2Dint16)(((ITEM2Dint64)v.x * mat.m[1][0] + (ITEM2Dint64)v.y * mat.m[1][1] + (1 << 28) ) >> 29); }

#define HW_MOD(a, b)                            ( a % (b) >= 0 ? a % (b) : (a % (b)) + (b) )
#define HW_FLOOR(x)                             ((x >> 3) << 3)
#define HW_CEIL(x)                              (((x + 7) >> 3) << 3)
#define HW_SQRT(x)                              ( (ITEM2Duint32)(sqrt((float)(x) / 0x10000) * 0x10000) )

#define TESSELLATION_CMD_LENGTH (65536)
#define INVALID_OBJECT_ID       65534    //0xFFFFFFF
#define INVALID_FRAME_ID        0xFFFFFFFF

typedef struct _ITEM2DHardwareRegister
{
    ITEM2Duint32 REG_TCR_BASE;      // 0x000
    ITEM2Duint32 REG_LWR_BASE;      // 0x004
    ITEM2Duint32 REG_SRNR_BASE;     // 0x008
    ITEM2Duint32 REG_FNR_BASE;      // 0x00C
    ITEM2Duint32 REG_PBR_BASE;      // 0x010
    ITEM2Duint32 REG_PLR_BASE;      // 0x014
    ITEM2Duint32 REG_TLR_BASE;      // 0x018
    ITEM2Duint32 REG_TBR_BASE;      // 0x01C
    ITEM2Duint32 REG_UTR00_BASE;    // 0x020
    ITEM2Duint32 REG_UTR01_BASE;    // 0x024
    ITEM2Duint32 REG_UTR02_BASE;    // 0x028
    ITEM2Duint32 REG_UTR10_BASE;    // 0x02C
    ITEM2Duint32 REG_UTR11_BASE;    // 0x030
    ITEM2Duint32 REG_UTR12_BASE;    // 0x034
    ITEM2Duint32 REG_UTR20_BASE;    // 0x038
    ITEM2Duint32 REG_UTR21_BASE;    // 0x03C
    ITEM2Duint32 REG_UTR22_BASE;    // 0x040
    ITEM2Duint32 REG_DPR00_BASE;    // 0x044
    ITEM2Duint32 REG_DPR01_BASE;    // 0x048
    ITEM2Duint32 REG_DPR02_BASE;    // 0x04C
    ITEM2Duint32 REG_DPR03_BASE;    // 0x050
    ITEM2Duint32 REG_DPR04_BASE;    // 0x054
    ITEM2Duint32 REG_DPR05_BASE;    // 0x058
    ITEM2Duint32 REG_DPR06_BASE;    // 0x05C
    ITEM2Duint32 REG_DPR07_BASE;    // 0x060
    ITEM2Duint32 REG_DPR08_BASE;    // 0x064
    ITEM2Duint32 REG_DPR09_BASE;    // 0x068
    ITEM2Duint32 REG_DPR10_BASE;    // 0x06C
    ITEM2Duint32 REG_DPR11_BASE;    // 0x070
    ITEM2Duint32 REG_DPR12_BASE;    // 0x074
    ITEM2Duint32 REG_DPR13_BASE;    // 0x078
    ITEM2Duint32 REG_DPR14_BASE;    // 0x07C
    ITEM2Duint32 REG_DPR15_BASE;    // 0x080
    ITEM2Duint32 REG_DPR16_BASE;    // 0x084
    ITEM2Duint32 REG_88_BASE;       // 0x088
    ITEM2Duint32 REG_8C_BASE;       // 0x08C
    ITEM2Duint32 REG_CCR_BASE;      // 0x090
    ITEM2Duint32 REG_CPBR_BASE;     // 0x094
    ITEM2Duint32 REG_CVPPR_BASE;    // 0x098
    ITEM2Duint32 REG_VPBR_BASE;     // 0x09C
    ITEM2Duint32 REG_PXCR_BASE;     // 0x0A0
    ITEM2Duint32 REG_PYCR_BASE;     // 0x0A4
    ITEM2Duint32 REG_SFR_BASE;      // 0x0A8
    ITEM2Duint32 REG_ACR_BASE;      // 0x0AC
    ITEM2Duint32 REG_RCR_BASE;      // 0x0B0
    ITEM2Duint32 REG_RMR_BASE;      // 0x0B4
    ITEM2Duint32 REG_RFR_BASE;      // 0x0B8
    ITEM2Duint32 REG_RSR01_BASE;    // 0x0BC
    ITEM2Duint32 REG_RSR23_BASE;    // 0x0C0
    ITEM2Duint32 REG_RSR45_BASE;    // 0x0C4
    ITEM2Duint32 REG_RSR67_BASE;    // 0x0C8
    ITEM2Duint32 REG_RCR00_BASE;    // 0x0CC
    ITEM2Duint32 REG_RCR01_BASE;    // 0x0D0
    ITEM2Duint32 REG_RCR10_BASE;    // 0x0D4
    ITEM2Duint32 REG_RCR11_BASE;    // 0x0D8
    ITEM2Duint32 REG_RCR20_BASE;    // 0x0DC
    ITEM2Duint32 REG_RCR21_BASE;    // 0x0E0
    ITEM2Duint32 REG_RCR30_BASE;    // 0x0E4
    ITEM2Duint32 REG_RCR31_BASE;    // 0x0E8
    ITEM2Duint32 REG_RCR40_BASE;    // 0x0EC
    ITEM2Duint32 REG_RCR41_BASE;    // 0x0F0
    ITEM2Duint32 REG_RCR50_BASE;    // 0x0F4
    ITEM2Duint32 REG_RCR51_BASE;    // 0x0F8
    ITEM2Duint32 REG_RCR60_BASE;    // 0x0FC
    ITEM2Duint32 REG_RCR61_BASE;    // 0x100
    ITEM2Duint32 REG_RCR70_BASE;    // 0x104
    ITEM2Duint32 REG_RCR71_BASE;    // 0x108
    ITEM2Duint32 REG_RDR01_BASE;    // 0x10C
    ITEM2Duint32 REG_RCR12_BASE;    // 0x110
    ITEM2Duint32 REG_RDR23_BASE;    // 0x114
    ITEM2Duint32 REG_RCR34_BASE;    // 0x118
    ITEM2Duint32 REG_RDR45_BASE;    // 0x11C
    ITEM2Duint32 REG_RCR56_BASE;    // 0x120
    ITEM2Duint32 REG_RDR67_BASE;    // 0x124
    ITEM2Duint32 REG_GPRA_BASE;     // 0x128
    ITEM2Duint32 REG_GPRB_BASE;     // 0x12C
    ITEM2Duint32 REG_GPRC_BASE;     // 0x130
    ITEM2Duint32 REG_GPRD0_BASE;    // 0x134
    ITEM2Duint32 REG_GPRD1_BASE;    // 0x138
    ITEM2Duint32 REG_GPRE0_BASE;    // 0x13C
    ITEM2Duint32 REG_GPRE1_BASE;    // 0x140
    ITEM2Duint32 REG_GPRF0_BASE;    // 0x144
    ITEM2Duint32 REG_GPRF1_BASE;    // 0x148
    ITEM2Duint32 REG_GPRG0_BASE;    // 0x14C
    ITEM2Duint32 REG_GPRG1_BASE;    // 0x150
    ITEM2Duint32 REG_GPRH0_BASE;    // 0x154
    ITEM2Duint32 REG_GPRH1_BASE;    // 0x158
    ITEM2Duint32 REG_GPRI0_BASE;    // 0x15C
    ITEM2Duint32 REG_GPRI1_BASE;    // 0x160
    ITEM2Duint32 REG_CTBR0_BASE;    // 0x164
    ITEM2Duint32 REG_CTBR1_BASE;    // 0x168
    ITEM2Duint32 REG_CTBR2_BASE;    // 0x16C
    ITEM2Duint32 REG_CTBR3_BASE;    // 0x170
    ITEM2Duint32 REG_DCR_BASE;      // 0x174
    ITEM2Duint32 REG_DHWR_BASE;     // 0x178
    ITEM2Duint32 REG_DBR_BASE;      // 0x17C
    ITEM2Duint32 REG_SDPR_BASE;     // 0x180
    ITEM2Duint32 REG_SCR_BASE;      // 0x184
    ITEM2Duint32 REG_SHWR_BASE;     // 0x188
    ITEM2Duint32 REG_SBR_BASE;      // 0x18C
    ITEM2Duint32 REG_SPR12_BASE;    // 0x190
    ITEM2Duint32 REG_SBR1_BASE;     // 0x194
    ITEM2Duint32 REG_SBR2_BASE;     // 0x198
    ITEM2Duint32 REG_MBR_BASE;      // 0x19C
    ITEM2Duint32 REG_SMPR_BASE;     // 0x1A0
    ITEM2Duint32 REG_SCBR_BASE;     // 0x1A4
    ITEM2Duint32 REG_UITR00_BASE;   // 0x1A8
    ITEM2Duint32 REG_UITR01_BASE;   // 0x1AC
    ITEM2Duint32 REG_UITR02_BASE;   // 0x1B0
    ITEM2Duint32 REG_UITR10_BASE;   // 0x1B4
    ITEM2Duint32 REG_UITR11_BASE;   // 0x1B8
    ITEM2Duint32 REG_UITR12_BASE;   // 0x1BC
    ITEM2Duint32 REG_UITR20_BASE;   // 0x1C0
    ITEM2Duint32 REG_UITR21_BASE;   // 0x1C4
    ITEM2Duint32 REG_UITR22_BASE;   // 0x1C8
    ITEM2Duint32 REG_PITR00_BASE;   // 0x1CC
    ITEM2Duint32 REG_PITR01_BASE;   // 0x1D0
    ITEM2Duint32 REG_PITR02_BASE;   // 0x1D4
    ITEM2Duint32 REG_PITR10_BASE;   // 0x1D8
    ITEM2Duint32 REG_PITR11_BASE;   // 0x1DC
    ITEM2Duint32 REG_PITR12_BASE;   // 0x1E0
    ITEM2Duint32 REG_CTSR0_BASE;    // 0x1E4
    ITEM2Duint32 REG_CTSR1_BASE;    // 0x1E8
    ITEM2Duint32 REG_TQSR_BASE;     // 0x1EC
    ITEM2Duint32 REG_CAR_BASE;      // 0x1F0
    ITEM2Duint32 REG_DPCR0_BASE;    // 0x1F4
    ITEM2Duint32 REG_DPCR1_BASE;    // 0x1F8
    ITEM2Duint32 REG_PPCR0_BASE;    // 0x1FC
    ITEM2Duint32 REG_PPCR1_BASE;    // 0x200
    ITEM2Duint32 REG_204_BASE;      // 0x204
    ITEM2Duint32 REG_208_BASE;      // 0x208
    ITEM2Duint32 REG_BISTR_BASE;    // 0x20C
    ITEM2Duint32 REG_CMDR_BASE;     // 0x210
    ITEM2Duint32 REG_ESR1_BASE;     // 0x214
    ITEM2Duint32 REG_ESR2_BASE;     // 0x218
    ITEM2Duint32 REG_ESR3_BASE;     // 0x21C
    ITEM2Duint32 REG_ESR4_BASE;     // 0x220
    ITEM2Duint32 REG_ICR_BASE;      // 0x224
    ITEM2Duint32 REG_BID1_BASE;     // 0x228
    ITEM2Duint32 REG_BID2_BASE;     // 0x22C
    ITEM2Duint32 REG_BID3_BASE;     // 0x230
    ITEM2Duint32 REG_BID4_BASE;     // 0x234
    ITEM2Duint32 REG_BID5_BASE;     // 0x238
    ITEM2Duint32 REG_BID6_BASE;     // 0x23C
    ITEM2Duint32 REG_REV_BASE;      // 0x240

    //ITEM2Duint32 tessellateCmd[TESSELLATION_CMD_LENGTH];
    //ITEM2Duint32 cmdLength; // Used command number
} ITEM2DHardwareRegister;

typedef struct
{
    ITEM2Duint            tessellateCmd[1 << 14];   // tessellate Command buffer
    ITEM2Duint            cmdData[1 << 16];         // command buffer

    /* Tessellation Engine */
    HWPaintMode           paintMode;
    ITEM2Ds15p16          lineWidth;
    HWVector2             min;
    HWVector2             max;
    HWMatrix3x3           pathTransform;    //s15.16

    HWCapStyle            strokeCapStyle;
    HWJoinStyle           strokeJoinStyle;
    ITEM2Ds12p3           strokeMiterLimit;

    HWboolean             enDashLine;
    HWboolean             dashPhaseReset;
    ITEM2Dint             dashMaxCount;
    ITEM2Ds15p16          dashPattern[17];      // s12.11
    ITEM2Ds15p16          dashRLength;
    ITEM2Duint8           dashCount;

    /* Mode settings */
    HWFillRule            fillRule;
    HWImageQuality        imageQuality;
    HWRenderingQuality    renderingQuality;
    HWBlendMode           blendMode;
    HWMaskMode            maskMode;
    HWImageMode           imageMode;

    /* enabling */
    HWboolean             enCoverage;       // enable coverage
    HWboolean             enScissor;
    HWboolean             enMask;
    HWboolean             enTexture;
    HWboolean             enColorTransform;
    HWboolean             enLookup;
    HWboolean             enBlend;
    HWboolean             enSrcMultiply;
    HWboolean             enSrcUnMultiply;
    HWboolean             enDstMultiply;
    HWboolean             enPerspective;

    /* color */
    ITEM2DColor           tileFillColor;    //Edge fill color for vgConvolve and pattern paint
    ITEM2DColor           clearColor;       // vgClear

    /* Matrices */
    HWMatrix3x3           fillTransform;    //s15.16
    HWMatrix3x3           strokeTransform;  //s15.16
    HWMatrix3x3           imageTransform;   //s15.16

    /* Paint */
    HWColorRampSpreadMode spreadMode;
    HWPaintType           paintType;
    ITEM2DColor           paintColor;
    HWTilingMode          tilingMode;
    ITEM2Duint8           *gradientData;
    ITEM2Duint8           gradientLen;

    ITEM2Ds15p16          linearGradientA;          //s15.16
    ITEM2Ds15p16          linearGradientB;          //s15.16
    ITEM2Ds15p16          linearGradientC;          //s15.16
    ITEM2Ds15p16          radialGradientA;          //s15.16
    ITEM2Ds15p16          radialGradientB;          //s15.16
    ITEM2Ds15p16          radialGradientC;          //s15.16
    ITEM2Ds15p16          radialGradientD;          //s15.16
    ITEM2Ds15p16          radialGradientE;          //s15.16
    ITEM2Ds15p16          radialGradientF;          //s15.16
    ITEM2Ds15p16          radialGradientG;          //s15.16
    ITEM2Ds15p16          radialGradientH;          //s15.16
    ITEM2Ds15p16          radialGradientI;          //s15.16

    /* Image */
    ITEM2Ds12p3           coverageX;            // S12.3
    ITEM2Ds12p3           coverageY;            // S12.3
    ITEM2Dint16           coverageWidth;        // 12
    ITEM2Dint16           coverageHeight;       // 12
    ITEM2Dint16           *coverageData;        // S10.5
    ITEM2Dint16           coveragevalidpitch;   // 6   byte aligment
    ITEM2Duint8           *coverageValid;       // 8 valid bits

    ITEM2Duint8           *textureData;
    ITEM2Duint16          texturePitch;     // 14
    ITEM2Dint16           textureWidth;
    ITEM2Dint16           textureHeight;
    ITEM2Duint8           textureFormat;

    ITEM2Duint8           *patternData;
    ITEM2Duint16          patternPitch;
    ITEM2Dint16           patternWidth;
    ITEM2Dint16           patternHeight;
    ITEM2Duint8           patternFormat;

    ITEM2Duint8           *maskData;
    ITEM2Ds12p3           maskX;
    ITEM2Ds12p3           maskY;
    ITEM2Duint16          maskPitch;
    ITEM2Dint16           maskWidth;
    ITEM2Dint16           maskHeight;
    ITEM2Duint8           maskFormat;

    ITEM2Duint8           *surfaceData;
    ITEM2Duint16          surfacePitch;
    ITEM2Dint16           surfaceWidth;
    ITEM2Dint16           surfaceHeight;
    ITEM2Duint8           surfaceFormat;

    ITEM2Ds12p3           dstX;
    ITEM2Ds12p3           dstY;
    ITEM2Dint16           dstWidth;
    ITEM2Dint16           dstHeight;

