/*
 */

#ifndef __ITEHARDWARE_H
#define __ITEHARDWARE_H

#include "openvg.h"
#include "iteDefs.h"
#include "iteVectors.h"
#include "itePath.h"

/* ======================================== */ 
/*              ITE Register                */
/* ======================================== */

//======================================
// Base address
//======================================
#define ITE_VG_AHB_REG_BASE  0xD0600000
#define ITE_VG_HOST_REG_BASE 0x6C00

//======================================
//Tessellation Control Register
//======================================
#define ITE_VG_REG_TCR_BASE     0x000
//
// D[31:12] Minter limit length (12.8)
//
#define ITE_VG_CMDSHIFT_MITERLIMIT  12
#define ITE_VG_CMDMASK_MITERLIMIT   0xFFFFF000

//
// D[15:14] Join Type 
// 00: Miter 
// 01: Round 
// 10: Bevel
//
#define ITE_VG_CMD_JOINTYPE_MITER   0x00000000
#define ITE_VG_CMD_JOINTYPE_ROUND   0x00004000
#define ITE_VG_CMD_JOINTYPE_BEVEL   0x00008000
#define ITE_VG_CMDSHIFT_JOINTYPE    14
#define ITE_VG_CMDMASK_JOINTYPE     0x0000C000
//
// D[13:12] Cap Type 
// 00: Square 
// 01: Round 
// 10: BUTT
//
#define ITE_VG_CMD_CAPTYPE_SQUARE   0x00000000
#define ITE_VG_CMD_CAPTYPE_ROUND    0x00001000
#define ITE_VG_CMD_CAPTYPE_BUTT     0x00002000
#define ITE_VG_CMDSHIFT_CAPTYPE     12
#define ITE_VG_CMDMASK_CAPTYPE      0x00003000

//
// D[11] Enable Perspective transform
//
#define ITE_VG_CMD_PERSPECTIVE_EN   0x00000800

//
// D[10] Enable Transform
//

  HW_PAINT_TYPE_RADIAL_GRADIENT               = 2,
  HW_PAINT_TYPE_PATTERN                       = 3
} HWPaintType;

typedef enum {
  HW_TILE_FILL                                = 0,
  HW_TILE_PAD                                 = 1,
  HW_TILE_REPEAT                              = 2,
  HW_TILE_REFLECT                             = 3
} HWTilingMode;

typedef enum {
  /* RGB{A,X} channel ordering */
  HW_sRGBX_8888                               =  0,
  HW_sRGBA_8888                               =  1,
  HW_sRGBA_8888_PRE                           =  2,
  HW_sRGB_565                                 =  3,
  HW_sRGBA_5551                               =  4,
  HW_sRGBA_4444                               =  5,
  HW_sL_8                                     =  6,
  HW_lRGBX_8888                               =  7,
  HW_lRGBA_8888                               =  8,
  HW_lRGBA_8888_PRE                           =  9,
  HW_lL_8                                     = 10,
  HW_A_8                                      = 11,
  HW_BW_1                                     = 12,
  HW_A_1                                      = 13,
  HW_A_4                                      = 14,
  HW_RGBA_16								  = 15,

  /* {A,X}RGB channel ordering */
  HW_sXRGB_8888                               =  0 | (1 << 6),
  HW_sARGB_8888                               =  1 | (1 << 6),
  HW_sARGB_8888_PRE                           =  2 | (1 << 6),
  HW_sARGB_1555                               =  4 | (1 << 6),
  HW_sARGB_4444                               =  5 | (1 << 6),
  HW_lXRGB_8888                               =  7 | (1 << 6),
  HW_lARGB_8888                               =  8 | (1 << 6),
  HW_lARGB_8888_PRE                           =  9 | (1 << 6),

  /* BGR{A,X} channel ordering */
  HW_sBGRX_8888                               =  0 | (1 << 7),
  HW_sBGRA_8888                               =  1 | (1 << 7),
  HW_sBGRA_8888_PRE                           =  2 | (1 << 7),
  HW_sBGR_565                                 =  3 | (1 << 7),
  HW_sBGRA_5551                               =  4 | (1 << 7),
  HW_sBGRA_4444                               =  5 | (1 << 7),
  HW_lBGRX_8888                               =  7 | (1 << 7),
  HW_lBGRA_8888                               =  8 | (1 << 7),
  HW_lBGRA_8888_PRE                           =  9 | (1 << 7),

  /* {A,X}BGR channel ordering */
  HW_sXBGR_8888                               =  0 | (1 << 6) | (1 << 7),
  HW_sABGR_8888                               =  1 | (1 << 6) | (1 << 7),
  HW_sABGR_8888_PRE                           =  2 | (1 << 6) | (1 << 7),
  HW_sABGR_1555                               =  4 | (1 << 6) | (1 << 7),
  HW_sABGR_4444                               =  5 | (1 << 6) | (1 << 7),
  HW_lXBGR_8888                               =  7 | (1 << 6) | (1 << 7),
  HW_lABGR_8888                               =  8 | (1 << 6) | (1 << 7),
  HW_lABGR_8888_PRE                           =  9 | (1 << 6) | (1 << 7),

} HWImageFormat;

typedef struct
{
  ITEs12p3 x,y;			//s12.3
} HWVector2;

typedef struct
{
  ITEs15p16 x,y;		//s15.16
} HWTXVector2;

typedef struct
{
  ITEs15p16 x;			//s15.16
  ITEs12p3  y;			//s12.3
} HWPXVector2;

typedef struct
{
  ITEs12p3 x,y,z;		//s12.3
} HWVector3;

typedef struct
{
  ITEs15p16 x,y,z;		//s15.16
} HWTXVector3;

typedef struct
{
  ITEs15p16 m[3][3];	//s15.16
} HWMatrix3x3;

// (v, mat, vout) = (s12.3, s15.16, s12.16)
#define HW0TRANSFORM3TO(v, mat, vout) { \
vout.x = (ITEint32)(((ITEint)v.x*mat.m[0][0] + (ITEint)v.y*mat.m[0][1] + (ITEint)v.z*mat.m[0][2] + (1<<2) )>>3); \
vout.y = (ITEint32)(((ITEint)v.x*mat.m[1][0] + (ITEint)v.y*mat.m[1][1] + (ITEint)v.z*mat.m[1][2] + (1<<2) )>>3); \
vout.z = (ITEint32)(((ITEint)v.x*mat.m[2][0] + (ITEint)v.y*mat.m[2][1] + (ITEint)v.z*mat.m[2][2] + (1<<2) )>>3); }

// (v, mat, vout) = (s12.3, s15.16, s12.3)
#define HW1TRANSFORM3TO(v, mat, vout) { \
vout.x = (ITEint16)(((ITEint)v.x*mat.m[0][0] + (ITEint)v.y*mat.m[0][1] + (ITEint)v.z*mat.m[0][2] + (1<<15) )>>16); \
vout.y = (ITEint16)(((ITEint)v.x*mat.m[1][0] + (ITEint)v.y*mat.m[1][1] + (ITEint)v.z*mat.m[1][2] + (1<<15) )>>16); \
vout.z = (ITEint16)(((ITEint)v.x*mat.m[2][0] + (ITEint)v.y*mat.m[2][1] + (ITEint)v.z*mat.m[2][2] + (1<<15) )>>16); }

// (v, mat, vout) = (s12.3, s15.16, s15.16)
#define HW0TRANSFORM2TO(v, mat, vout) { \
vout.x = (ITEint32)(((ITEint)v.x*mat.m[0][0] + (ITEint)v.y*mat.m[0][1] + 8*mat.m[0][2] + (1<<2) )>>3); \
vout.y = (ITEint32)(((ITEint)v.x*mat.m[1][0] + (ITEint)v.y*mat.m[1][1] + 8*mat.m[1][2] + (1<<2) )>>3); }

// (v, mat, vout) = (s15.16, s15.16, s12.3)
#define HW1TRANSFORM2TO(v, mat, vout) { \
vout.x = (ITEint16)(((ITEint64)v.x*mat.m[0][0] + (ITEint64)v.y*mat.m[0][1] + (ITEint64)0x10000*mat.m[0][2] + (1<<28) )>>29); \
vout.y = (ITEint16)(((ITEint64)v.x*mat.m[1][0] + (ITEint64)v.y*mat.m[1][1] + (ITEint64)0x10000*mat.m[1][2] + (1<<28) )>>29); }

// (v, mat, vout) = (s12.11, s15.16, s12.3)
#define HWAFFINETRANSFORM2TO(v, mat, vout) { \
vout.x = (ITEint32)(((ITEint64)v.x*mat.m[0][0] + (ITEint64)v.y*mat.m[0][1] + (ITEint64)(1<<POINTPREC)*mat.m[0][2] + (1<<((POINTPREC+16-3)-1)) )>>(POINTPREC+16-3)); \
vout.y = (ITEint32)(((ITEint64)v.x*mat.m[1][0] + (ITEint64)v.y*mat.m[1][1] + (ITEint64)(1<<POINTPREC)*mat.m[1][2] + (1<<((POINTPREC+16-3)-1)) )>>(POINTPREC+16-3)); }

// (v, mat, vout) = (s12.11, s15.16, s12.3 = s12.19 / s12.16)
#define HWPERSPECTIVETRANSFORM3TO(v, mat, vout) { \
vout.x = (ITEint32)( (((ITEint64)v.x*mat.m[0][0] + (ITEint64)v.y*mat.m[0][1] + (ITEint64)(1<<POINTPREC)*mat.m[0][2] + (1<<(POINTPREC+16-19-1)) )>>(POINTPREC+16-19)) / \
	                 (((ITEint64)v.x*mat.m[2][0] + (ITEint64)v.y*mat.m[2][1] + (ITEint64)(1<<POINTPREC)*mat.m[2][2] + (1<<(POINTPREC+16-19-1)) )>>(POINTPREC+16-16)) ); \
vout.y = (ITEint32)( (((ITEint64)v.x*mat.m[1][0] + (ITEint64)v.y*mat.m[1][1] + (ITEint64)(1<<POINTPREC)*mat.m[1][2] + (1<<(POINTPREC+16-19-1)) )>>(POINTPREC+16-19)) / \
					 (((ITEint64)v.x*mat.m[2][0] + (ITEint64)v.y*mat.m[2][1] + (ITEint64)(1<<POINTPREC)*mat.m[2][2] + (1<<(POINTPREC+16-19-1)) )>>(POINTPREC+16-16)) ); }

// (v, mat, vout) = (s15.16, s15.16, s12.3)
#define HW1TRANSFORM2DIR(v, mat, vout) { \
vout.x = (ITEint16)(((ITEint64)v.x*mat.m[0][0] + (ITEint64)v.y*mat.m[0][1] + (1<<28) )>>29); \
vout.y = (ITEint16)(((ITEint64)v.x*mat.m[1][0] + (ITEint64)v.y*mat.m[1][1] + (1<<28) )>>29); }

#define HW_MOD(a,b) ( a%(b)>=0 ? a%(b) : (a%(b))+(b) ) 
#define HW_FLOOR(x) ((x>>3)<<3)
#define HW_CEIL(x) (((x+7)>>3)<<3)
#define HW_SQRT(x) ( (ITEuint32)(sqrt((float)(x)/0x10000)*0x10000) )

#define TESSELLATION_CMD_LENGTH (65536)
#define INVALID_OBJECT_ID			0xFFFFFFFF
#define INVALID_FRAME_ID			0xFFFFFFFF

typedef struct _ITEHardwareRegister
{	
	ITEuint32 REG_TCR_BASE;			// 0x000
	ITEuint32 REG_LWR_BASE;			// 0x004
	ITEuint32 REG_SRNR_BASE;		// 0x008
	ITEuint32 REG_FNR_BASE;			// 0x00C
	ITEuint32 REG_PBR_BASE;			// 0x010
	ITEuint32 REG_PLR_BASE;			// 0x014
	ITEuint32 REG_TLR_BASE;			// 0x018
	ITEuint32 REG_TBR_BASE;			// 0x01C
	ITEuint32 REG_UTR00_BASE;		// 0x020
	ITEuint32 REG_UTR01_BASE;		// 0x024
	ITEuint32 REG_UTR02_BASE;		// 0x028
	ITEuint32 REG_UTR10_BASE;		// 0x02C
	ITEuint32 REG_UTR11_BASE;		// 0x030
	ITEuint32 REG_UTR12_BASE;		// 0x034
	ITEuint32 REG_UTR20_BASE;		// 0x038
	ITEuint32 REG_UTR21_BASE;		// 0x03C
	ITEuint32 REG_UTR22_BASE;		// 0x040
	ITEuint32 REG_DPR00_BASE;		// 0x044
	ITEuint32 REG_DPR01_BASE;		// 0x048
	ITEuint32 REG_DPR02_BASE;		// 0x04C
	ITEuint32 REG_DPR03_BASE;		// 0x050
	ITEuint32 REG_DPR04_BASE;		// 0x054
	ITEuint32 REG_DPR05_BASE;		// 0x058
	ITEuint32 REG_DPR06_BASE;		// 0x05C
	ITEuint32 REG_DPR07_BASE;		// 0x060
	ITEuint32 REG_DPR08_BASE;		// 0x064
	ITEuint32 REG_DPR09_BASE;		// 0x068
	ITEuint32 REG_DPR10_BASE;		// 0x06C
	ITEuint32 REG_DPR11_BASE;		// 0x070
	ITEuint32 REG_DPR12_BASE;		// 0x074
	ITEuint32 REG_DPR13_BASE;		// 0x078
	ITEuint32 REG_DPR14_BASE;		// 0x07C
	ITEuint32 REG_DPR15_BASE;		// 0x080
	ITEuint32 REG_DPR16_BASE;		// 0x084
	ITEuint32 REG_88_BASE;		    // 0x088
	ITEuint32 REG_8C_BASE;		    // 0x08C	
	ITEuint32 REG_CCR_BASE;			// 0x090
	ITEuint32 REG_CPBR_BASE;		// 0x094
	ITEuint32 REG_CVPPR_BASE;		// 0x098
	ITEuint32 REG_VPBR_BASE;		// 0x09C
	ITEuint32 REG_PXCR_BASE;		// 0x0A0
	ITEuint32 REG_PYCR_BASE;		// 0x0A4
	ITEuint32 REG_SFR_BASE;		    // 0x0A8
	ITEuint32 REG_ACR_BASE;			// 0x0AC
	ITEuint32 REG_RCR_BASE;			// 0x0B0
	ITEuint32 REG_RMR_BASE;			// 0x0B4
	ITEuint32 REG_RFR_BASE;			// 0x0B8
	ITEuint32 REG_RSR01_BASE;		// 0x0BC
	ITEuint32 REG_RSR23_BASE;		// 0x0C0
	ITEuint32 REG_RSR45_BASE;		// 0x0C4
	ITEuint32 REG_RSR67_BASE;		// 0x0C8
	ITEuint32 REG_RCR00_BASE;		// 0x0CC
	ITEuint32 REG_RCR01_BASE;		// 0x0D0
	ITEuint32 REG_RCR10_BASE;		// 0x0D4
	ITEuint32 REG_RCR11_BASE;		// 0x0D8
	ITEuint32 REG_RCR20_BASE;		// 0x0DC
	ITEuint32 REG_RCR21_BASE;		// 0x0E0
	ITEuint32 REG_RCR30_BASE;		// 0x0E4
	ITEuint32 REG_RCR31_BASE;		// 0x0E8
	ITEuint32 REG_RCR40_BASE;		// 0x0EC
	ITEuint32 REG_RCR41_BASE;		// 0x0F0
	ITEuint32 REG_RCR50_BASE;		// 0x0F4
	ITEuint32 REG_RCR51_BASE;		// 0x0F8
	ITEuint32 REG_RCR60_BASE;		// 0x0FC
	ITEuint32 REG_RCR61_BASE;		// 0x100
	ITEuint32 REG_RCR70_BASE;		// 0x104
	ITEuint32 REG_RCR71_BASE;		// 0x108
	ITEuint32 REG_RDR01_BASE;		// 0x10C
	ITEuint32 REG_RCR12_BASE;		// 0x110
	ITEuint32 REG_RDR23_BASE;		// 0x114
	ITEuint32 REG_RCR34_BASE;		// 0x118
	ITEuint32 REG_RDR45_BASE;		// 0x11C
	ITEuint32 REG_RCR56_BASE;		// 0x120
	ITEuint32 REG_RDR67_BASE;		// 0x124
	ITEuint32 REG_GPRA_BASE;		// 0x128
	ITEuint32 REG_GPRB_BASE;		// 0x12C
	ITEuint32 REG_GPRC_BASE;		// 0x130
	ITEuint32 REG_GPRD0_BASE;		// 0x134
	ITEuint32 REG_GPRD1_BASE;		// 0x138
	ITEuint32 REG_GPRE0_BASE;		// 0x13C
	ITEuint32 REG_GPRE1_BASE;		// 0x140
	ITEuint32 REG_GPRF0_BASE;		// 0x144
	ITEuint32 REG_GPRF1_BASE;		// 0x148
	ITEuint32 REG_GPRG0_BASE;		// 0x14C
	ITEuint32 REG_GPRG1_BASE;		// 0x150
	ITEuint32 REG_GPRH0_BASE;		// 0x154
	ITEuint32 REG_GPRH1_BASE;		// 0x158
	ITEuint32 REG_GPRI0_BASE;		// 0x15C
	ITEuint32 REG_GPRI1_BASE;		// 0x160
	ITEuint32 REG_CTBR0_BASE;		// 0x164
	ITEuint32 REG_CTBR1_BASE;		// 0x168
	ITEuint32 REG_CTBR2_BASE;		// 0x16C
	ITEuint32 REG_CTBR3_BASE;		// 0x170
	ITEuint32 REG_DCR_BASE;			// 0x174
	ITEuint32 REG_DHWR_BASE;		// 0x178
	ITEuint32 REG_DBR_BASE;			// 0x17C
	ITEuint32 REG_SDPR_BASE;		// 0x180
	ITEuint32 REG_SCR_BASE;			// 0x184
	ITEuint32 REG_SHWR_BASE;		// 0x188
	ITEuint32 REG_SBR_BASE;			// 0x18C
	ITEuint32 REG_SPR12_BASE;		// 0x190
	ITEuint32 REG_SBR1_BASE;		// 0x194
	ITEuint32 REG_SBR2_BASE;		// 0x198
	ITEuint32 REG_MBR_BASE;			// 0x19C
	ITEuint32 REG_SMPR_BASE;		// 0x1A0
	ITEuint32 REG_SCBR_BASE;		// 0x1A4
	ITEuint32 REG_UITR00_BASE;		// 0x1A8
	ITEuint32 REG_UITR01_BASE;		// 0x1AC
	ITEuint32 REG_UITR02_BASE;		// 0x1B0
	ITEuint32 REG_UITR10_BASE;		// 0x1B4
	ITEuint32 REG_UITR11_BASE;		// 0x1B8
	ITEuint32 REG_UITR12_BASE;		// 0x1BC
	ITEuint32 REG_UITR20_BASE;		// 0x1C0
	ITEuint32 REG_UITR21_BASE;		// 0x1C4
	ITEuint32 REG_UITR22_BASE;		// 0x1C8
	ITEuint32 REG_PITR00_BASE;		// 0x1CC
	ITEuint32 REG_PITR01_BASE;		// 0x1D0
	ITEuint32 REG_PITR02_BASE;		// 0x1D4
	ITEuint32 REG_PITR10_BASE;		// 0x1D8
	ITEuint32 REG_PITR11_BASE;		// 0x1DC
	ITEuint32 REG_PITR12_BASE;		// 0x1E0
	ITEuint32 REG_CTSR0_BASE;		// 0x1E4
	ITEuint32 REG_CTSR1_BASE;		// 0x1E8
	ITEuint32 REG_TQSR_BASE;		// 0x1EC
	ITEuint32 REG_CAR_BASE;			// 0x1F0
	ITEuint32 REG_DPCR0_BASE;		// 0x1F4
	ITEuint32 REG_DPCR1_BASE;		// 0x1F8
	ITEuint32 REG_PPCR0_BASE;		// 0x1FC
	ITEuint32 REG_PPCR1_BASE;		// 0x200
	ITEuint32 REG_204_BASE;			// 0x204
	ITEuint32 REG_208_BASE;			// 0x208
	ITEuint32 REG_BISTR_BASE;		// 0x20C
	ITEuint32 REG_CMDR_BASE;		// 0x210
	ITEuint32 REG_ESR1_BASE;		// 0x214
	ITEuint32 REG_ESR2_BASE;		// 0x218
	ITEuint32 REG_ESR3_BASE;		// 0x21C
	ITEuint32 REG_ESR4_BASE;		// 0x220
	ITEuint32 REG_ICR_BASE;			// 0x224
	ITEuint32 REG_BID1_BASE;		// 0x228
	ITEuint32 REG_BID2_BASE;		// 0x22C
	ITEuint32 REG_BID3_BASE;		// 0x230
	ITEuint32 REG_BID4_BASE;		// 0x234
	ITEuint32 REG_BID5_BASE;		// 0x238
	ITEuint32 REG_BID6_BASE;		// 0x23C
	ITEuint32 REG_REV_BASE;			// 0x240

	//ITEuint32 tessellateCmd[TESSELLATION_CMD_LENGTH];
    //ITEuint32 cmdLength; // Used command number
}ITEHardwareRegister;

typedef struct
{
	ITEuint				tessellateCmd[1<<14];	// tessellate Command buffer
	ITEuint				cmdData[1<<16];			// command buffer

	/* Tessellation Engine */
	HWPaintMode			paintMode;
	ITEs15p16			lineWidth;
	HWVector2			min;
	HWVector2			max;
	HWMatrix3x3			pathTransform;		//s15.16
	
	HWCapStyle			strokeCapStyle;
	HWJoinStyle			strokeJoinStyle;
	ITEs12p3			strokeMiterLimit;

	HWboolean           enDashLine;
	HWboolean           dashPhaseReset;
	ITEint				dashMaxCount;
	ITEs15p16			dashPattern[17];	// s12.11
	ITEs15p16			dashRLength;
	ITEuint8			dashCount;

  /* Mode settings */
	HWFillRule          fillRule;
	HWImageQuality      imageQuality;
	HWRenderingQuality  renderingQuality;
	HWBlendMode			blendMode;
	HWMaskMode			maskMode;
	HWImageMode         imageMode;

  /* enabling */
	HWboolean			enCoverage;			// enable coverage
	HWboolean           enScissor;
	HWboolean			enMask;  
	HWboolean			enTexture; 
	HWboolean			enColorTransform;
	HWboolean			enLookup;
	HWboolean           enBlend;
	HWboolean           enSrcMultiply;
	HWboolean           enSrcUnMultiply;
	HWboolean           enDstMultiply;
	HWboolean			enPerspective;

	/* color */
	ITEColor			tileFillColor;		//Edge fill color for vgConvolve and pattern paint  
	ITEColor			clearColor;			// vgClear

	/* Matrices */
	HWMatrix3x3			fillTransform;		//s15.16
	HWMatrix3x3			strokeTransform;	//s15.16
	HWMatrix3x3			imageTransform;		//s15.16

	/* Paint */
	HWColorRampSpreadMode spreadMode;
	HWPaintType			paintType;
	ITEColor			paintColor;
	HWTilingMode		tilingMode;
	ITEuint8			*gradientData;
	ITEuint8            gradientLen;

	ITEs15p16			linearGradientA;		//s15.16
	ITEs15p16			linearGradientB;		//s15.16
	ITEs15p16			linearGradientC;		//s15.16
	ITEs15p16			radialGradientA;		//s15.16
	ITEs15p16			radialGradientB;		//s15.16
	ITEs15p16			radialGradientC;		//s15.16
	ITEs15p16			radialGradientD;		//s15.16
	ITEs15p16			radialGradientE;		//s15.16
	ITEs15p16			radialGradientF;		//s15.16
	ITEs15p16			radialGradientG;		//s15.16
	ITEs15p16			radialGradientH;		//s15.16
	ITEs15p16			radialGradientI;		//s15.16

	/* Image */
	ITEs12p3			coverageX;				// S12.3
	ITEs12p3			coverageY;				// S12.3
	ITEint16			coverageWidth;			// 12
	ITEint16			coverageHeight;			// 12
	ITEint16			*coverageData;			// S10.5
	ITEint16			coveragevalidpitch;		// 6   byte aligment
	ITEuint8			*coverageValid;			// 8 valid bits


	ITEuint8			*textureData;
	ITEuint16			texturePitch;	// 14
	ITEint16			textureWidth;
	ITEint16			textureHeight;
	ITEuint8			textureFormat;

	ITEuint8			*patternData;
	ITEuint16			patternPitch;
	ITEint16			patternWidth;
	ITEint16			patternHeight;
	ITEuint8			patternFormat;

	ITEuint8			*maskData;
	ITEs12p3			maskX;		
	ITEs12p3			maskY;		
	ITEuint16			maskPitch;
	ITEint16			maskWidth;
	ITEint16			maskHeight;
	ITEuint8			maskFormat;

	ITEuint8			*surfaceData;
	ITEuint16			surfacePitch;
	ITEint16			surfaceWidth;
	ITEint16			surfaceHeight;
	ITEuint8			surfaceFormat;

	ITEs12p3            dstX;
	ITEs12p3			dstY;
	ITEint16			dstWidth;
	ITEint16			dstHeight;

  /* four point of the stroke path to do cap and join */ 
  //	recm0 |-----------------------| recm1
  //		  |						  |
  //		  |---------------------->|
  //		  |		    UnitV		  |
  //	recm3 |-----------------------| recm2
	ITEuint16			strokeRoundLines;
	HWTXVector2			strokeRoundC;		// s12.11

	ITEint8				LastisMove;
	HWTXVector2			strokestartrecm0;	// s12.11
